package main

import "fmt"

/**
2.下面代码输出什么？
*/
func two() {
	// 例一
	fmt.Println(3^2+4^2 == 5^2) // true

	// 例二
	fmt.Println(6^2+8^2 == 10^2) // false
	fmt.Println(6 ^ 2)
	fmt.Println(8 ^ 2)
	fmt.Println(10 ^ 2)

	/**
	在 Go 语言里面，^ 作为二元运算符时表示按位异或：对应位，相同为 0，相异为 1。所以第一段代码输出 true 是因为：

	例一
	0011 ^ 0010 == 0001   (3^2 == 1)
	0100 ^ 0010 == 0110   (4^2 == 6)
	0101 ^ 0010 == 0111   (5^2 == 7)

	例二
	0110 ^ 0010 == 0100   (6^2 == 4)
	1000 ^ 0010 == 1010	  (8^2 == 10)
	1010 ^ 0010 == 1000	  (10^2 == 8)
	*/
}

func main() {
	two()
}
